{
    "hello":"Hellow world",
    "home":{
        "name":"Jose Rodriguez Caceres",
        "links":{
            "button":"Links",
            "home":"Home",
            "robotics":"Robotics",
            "developer":"Developer",
            "photography":"Photographer",
            "proyects":"Proyects",
            "contact":"Contact me"
        },
        "description":{
            "dev":"FullStack Developer",
            "rob":"Industrial robotics technician",
            "fot":"Pohotographer and editor"
        },
        "titles":{
            "daw":"Higher degree in web application development",
            "ari":"Higher degree in industrial automation and robotics"
        },
        "more":"More info here",
        "dawTitle":"Web development",
        "dawDesc":"I spent 3 years studying and programming web and desktop applications with Java 8, Java 17, JSP, ReactJS, and NextJS. I also have a solid knowledge of databases and I have worked with Oracle's SQL and PL/SQL, MySQL in MariaDB, and Microsoft SQL Server.",
        "robTitle":"Industrial automation and robotics",
        "robDesc":"I have been studying industrial automation and robotics. I have worked on installing power electrical networks, automating industrial processes, and have been involved in team projects where I gained knowledge in artificial intelligence.",
        "longDescription":"Hello! I'm José and I'm passionate about technology and research. I'm a FullStack developer and a industrial robotics technician from Seville. I enjoy developing incredible solutions by working with new technologies. I'm very skilled in analysis and research, and I'm also very resourceful and disciplined, so I can overcome any challenge or problem very effectively.",
        "tech":"These are the technologies I have worked with and I am familiar with:"
    },
    "proyects":{
        "more":"See more on GitHub ",
        "info":"Click the image for more info.",
        "visual":{
            "title":"Artificial vision and Neural Networks",
            "description":"I built a neural network and trained it to recognize vehicle wheels and people. The network is capable of sending a signal to a robot for wheel retrieval, and it also features a safety mechanism that stops operation upon detecting a person in the facility, sending a message to the person in charge. I executed the neural network on limited hardware (Nvidia Jetson Nano 2GB), which involved optimization tasks.",
            "p1":"",
            "p2":"",
            "p3":"",
            "redirect":"Look at it on GitHub:",
            "aptitudes":["Teamwork","Python","Tensorflow","OpenCV","Problem solving","Research","ML","Data analysis"]
        },
        "car":{
            "title":"Color and shape detection",
            "description":"This project involves a program that enables a Nvidia Jetson Nano to detect, through a camera, a series of Lego figures based on their color and shape using the OpenCV libraries. Additionally, it establishes a communication channel with an Arduino to determine the distance to the object and, finally, uses a gripper to pick it up and store it.",
            "p1":"",
            "p2":"",
            "p3":"",
            "redirect":"",
            "aptitudes":["Teamwork","Python","OpenCV","Problem solving","Research","GPIO","Data analysis"]
        },
        "http":{
            "title":"HTTP Server",
            "description":"HTTP Server in Java from scratch",
            "p1":"",
            "p2":"",
            "p3":"",
            "redirect":"(Under development)",
            "aptitudes":["(Under development)"]
        }
    }
    
}