{
    "contact":"You can contact me here:",
    "home":{
        "name":"Jose Rodriguez Caceres",
        "links":{
            "button":"Links",
            "home":"Home",
            "robotics":"Robotics",
            "developer":"Developer",
            "photography":"Photographer",
            "proyects":"Proyects",
            "contact":"Contact me"
        },
        "description":{
            "dev":"FullStack Developer",
            "rob":"Industrial robotics technician",
            "fot":"Pohotographer and editor"
        },
        "titles":{
            "daw":"Higher degree in web application development",
            "ari":"Higher degree in industrial automation and robotics"
        },
        "more":"More info here",
        "dawTitle":"Web development",
        "dawDesc":"I spent 3 years studying and programming web and desktop applications with Java 8, Java 17, JSP, ReactJS, and NextJS. I also have a solid knowledge of databases and I have worked with Oracle's SQL and PL/SQL, MySQL in MariaDB, and Microsoft SQL Server.",
        "robTitle":"Industrial automation and robotics",
        "robDesc":"I have been studying industrial automation and robotics. I have worked on installing power electrical networks, automating industrial processes, and have been involved in team projects where I gained knowledge in artificial intelligence.",
        "longDescription":"Hello! I'm José and I'm passionate about technology and research. I'm a FullStack developer and a industrial robotics technician from Seville. I enjoy developing incredible solutions by working with new technologies. I'm very skilled in analysis and research, and I'm also very resourceful and disciplined, so I can overcome any challenge or problem very effectively.",
        "tech":"These are the technologies I have worked with and I am familiar with:"
    },
    "photographer":{
        "title":"Fotographer and editor"
    },
    "developer":{
        "description":"I have studied programming at the CDP José Cabrera center in Trebujena. Over 2 years, I have increased my programming knowledge acquired from my previous studies in robotics and expanded upon it. During this time, I have completed various projects, such as library management programs using MySql, Java, and Swing, web applications for buying and selling items with user control, user-specific shopping carts, and form verification using Java web, JSP, HTML, CSS, Bootstrap, and JavaScript. I have also gained experience in version control using Git, and developed dynamic apps with React and Next.js.",
        "d2":"Also, I have knowledge of Spring Boot and its use for microservices, along with the creation of REST APIs with Java. I am familiar with XML and JSON and how to read these files from JavaScript using fetch, and from Java using the File class. I also have basic proficiency in Docker.",
        "d3":"I have created relational databases using Oracle databases and its SQLDeveloper (SQL, PL/SQL, Triggers). Additionally, I have developed functional applications using Azure and Firebase services."
    },
    "robotics":{
        "d1": "I studied a higher degree in industrial automation and robotics at the Salesian College Manuel Lora Tamayo in Jerez de la Frontera. During that time, I learned about pneumatics, electricity, and electronics. I began my journey into programming by creating algorithms in C++, KOP, and AWL on Siemens PLCs. I also learned AutoCAD.",
        "d2": "Later, I learned to communicate Siemens PLCs in a network and to program SCADA on graphical screens. I have programmed ABB and Fanuc robotic arms. I have also got into advanced C++ programming and Arduino programming.",
        "d3": "In a series of team projects, I worked with Python for image analysis using OpenCV, Pandas, Matplotlib, and a camera on a Nvidia Jetson Nano. Additionally, I worked on neural networks using TensorFlow."
    },
    "proyects":{
        "more":"See more on GitHub ",
        "info":"Click the image for more info.",
        "visual":{
            "title":"Artificial vision and Neural Networks",
            "description":"I built a neural network and trained it to recognize vehicle wheels and people. The network is capable of sending a signal to a robot for wheel retrieval, and it also features a safety mechanism that stops operation upon detecting a person in the facility, sending a message to the person in charge. I executed the neural network on limited hardware (Nvidia Jetson Nano 2GB), which involved optimization tasks.",
            "p1":"",
            "p2":"",
            "p3":"",
            "redirect":"Look at it on GitHub  clicking the image.",
            "aptitudes":["Teamwork","Python","Tensorflow","OpenCV","Problem solving","Research","ML","Data analysis"]
        },
        "car":{
            "title":"Color and shape detection",
            "description":"This project involves a program that enables a Nvidia Jetson Nano to detect, through a camera, a series of Lego figures based on their color and shape using the OpenCV libraries. Additionally, it establishes a communication channel with an Arduino to determine the distance to the object and, finally, uses a gripper to pick it up and store it.",
            "p1":"",
            "p2":"",
            "p3":"",
            "redirect":"",
            "aptitudes":["Teamwork","Python","OpenCV","Problem solving","Research","GPIO","Data analysis"]
        },
        "http":{
            "title":"HTTP Server",
            "description":"HTTP Server in Java from scratch",
            "p1":"",
            "p2":"",
            "p3":"",
            "redirect":"(Under development)",
            "aptitudes":["(Under development)"]
        }
    }
    
}