{
    "home":{
        "name":"José Rodríguez Cáceres",
        "links":{
            "button":"Enlaces",
            "home":"Principal",
            "robotics":"Robótica",
            "developer":"Desarrollador",
            "photography":"Fotógrafo",
            "proyects":"Proyectos",
            "contact":"Contactame"
        },
        "description":{
            "dev":"Desarrollador FullStack",
            "rob":"Tecnico en robotica industrial",
            "fot":"Fotografo y editor"
        },
        "titles":{
            "daw":"Técnico superior en desarrollo de aplicaciones web",
            "ari":"Técnico superior en automatización y robótica industrial"
        },
        "more":"Mas información aquí",
        "dawTitle":"Desarrollo de aplicaciones web",
        "dawDesc":"He pasado 3 años estudiando y programando aplicaciones web y de escritorio con Java 8, Java 17, JSP, ReactJS y NextJS. También tengo un sólido conocimiento en bases de datos y he trabajado con SQL y PL/SQL de Oracle, MySQL en MariaDB y Microsoft SQL Server.",
        "robTitle":"Automatización y robótica industrial",
        "robDesc":"He estado estudiando automatización y robótica industrial. He trabajado en la instalación de redes eléctricas de potencia, automatizando procesos industriales. Además, he participado en proyectos de equipo donde he adquirido conocimientos en inteligencia artificial.",
        "longDescription":"¡Hola! Soy José y me apasiona la tecnología y la investigación. Soy un programador FullStack y técnico en automatización y robótica de Sevilla. Me gusta desarrollar soluciones increíbles trabajando con nuevas tecnologías. Soy muy bueno en el análisis e investigación, además soy muy resolutivo y disciplinado, así que puedo superar cualquier reto y problema de manera muy efectiva.",
        "tech":"Estas son las tecnologias con las que he trabajado y me familiarizo con ellas:"
    },
    "photographer":{
        "title":"Fotógrafo y editor"
    },
    "developer":{
        "description":"He estudiado programación en un grado superior de desarrollo de aplicaciones web en el centro CDP José Cabrera en trebujena. Durante 2 años he afianzado los conocimientos que ya tenia de programación por mis estudios anteriores en robotica y los he expandido. En este tiempo he realizado diversos proyectos como programas de gestión de bibliotecas usando MySql, Java y Swing, aplicaciones web de compra-venta de articulos con control de usuarios, carrito de la compra por usuario y verificación de formularios usando Java web, JSP, HTML, CSS, Boostrap y JavaScript. También control de versiones usando Git y desarrollo de apps dinamicas con React y Next.JS ",
        "d2":"Ademas, cuento con conocimientos de SpringBoot y su uso para microservicios,a lo que ademas se añade la creación de API Rest con Java. A esto se le añade XML y JSON como leer estos ficheros desde JavaScript con fetch y Java con el uso de la clase File. Uso basico de Docker",
        "d3":"He creado bases de datos relacionales usando bases de datos de Oracle y su SQLDeveloper(SQL, PL/SQL, Triggers). He publicado aplicaciones funcionales utilizando el servicio de Azure (Con SQL Server) y Firebase"
    },
    "robotics":{
        "d1": "Estudie un grado superior de automatizacióny robotica industrial en el Colegio Salesiano Manuel Lora Tamayo de Jerez de la frontera. En ese tiempo aprendí neumatica, electricidad y electrónica. Empezó vi viaje por la programación realizando algoritmos en C++, KOP y AWL en PLC de Siemens. También Autocad.",
        "d2": "Luego, aprendí a comunicar PLC de siemens en red y a programar SCADA en pantallas graficas. He programado brazos robots de ABB y de Fanuc. Programación C++ más avanzada y programación de Arduinos.",
        "d3": "En una serie de proyectos en equipo trabajé con Python, anlisis de imagenes con OpenCV, Pandas, Matplotlib y una camara en una Nvidia Jetson Nano, y, redes neuronales con TensorFlow."
    },
    "proyects":{
        "more":"Ver mas trabajos en GitHub ",
        "info":"Click en la imagen para mas información.",
        "visual":{
            "title":"Visión artificial y redes neuronales",
            "description":"TFG sobre automatización y robótica: Construí una red neuronal y la entrené para reconocer ruedas de vehículos y personas. La red es capaz de enviar una señal a un robot para recoger la rueda, y también cuenta con un mecanismo de seguridad que detiene la operación si detecta a una persona en la instalación, enviando un mensaje al responsable. Ejecuté la red neuronal en un hardware reducido (Nvidia Jetson Nano 2GB), lo que implicó tareas de optimización.",
            "p1":"",
            "p2":"",
            "p3":"",
            "redirect":"Puedes ver el proyecto en GitHub pulsando la imagen.",
            "aptitudes":["Trabajo en equipo","Python","Tensorflow","OpenCV","Resolución de problemas","Investigación","ML","Análisis de datos"]
        },
        "car":{
            "title":"Detección de color y formas",
            "description":"Este proyecto consiste en un programa que permite a una Nvidia Jetson Nano detectar, a través de una cámara, una serie de figuras de Lego basadas en su color y forma utilizando las librerías de OpenCV. Además, establece un canal de comunicación con un Arduino para determinar la distancia hasta el objeto y, finalmente, utilizar una pinza para recogerlo y guardarlo.",
            "p1":"",
            "p2":"",
            "p3":"",
            "redirect":"Puedes ver el proyecto en GitHub: ",
            "aptitudes":["Trabajo en equipo","Python","OpenCV","Resolución de problemas","Investigación","GPIO","Autoaprendizaje"]
        },
        "http":{
            "title":"Servidor HTTP",
            "description":"Servidor HTTP desde 0 en Java (En desarrollo)",
            "p1":"",
            "p2":"",
            "p3":"",
            "redirect":"(En desarrollo)",
            "aptitudes":["(En desarrollo)"]
        }
    }
}